Revit 2024 API
ViewSheet.GetCurrentRevision Method
 Returns the most recent numbered Revision shown on this ViewSheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId GetCurrentRevision()
Visual Basic
Public Function GetCurrentRevision As ElementId
Visual C++
public:
ElementId^ GetCurrentRevision()
Return Value
 The Id of the most recent numbered Revision shown on this ViewSheet or InvalidElementId if none are shown.
Remarks
 If the most recent Revision is not issued, Revit will typically use it as the default Revision for RevisionClouds placed on this ViewSheet. InvalidElementId will be returned if no Revisions are present. Revisions with RevisionNumberType.None will not be returned.
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace